tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"


# shell
brew "neovim", args: ["HEAD"]
brew "bat"
brew "fd"
brew "jq"
brew "ripgrep"
brew "gh"
brew "git"
brew "git-delta"
brew "lazygit"
brew "gnupg"
brew "podman"
brew "tmux"
brew "starship"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# languages and runtimes
brew "node"
brew "deno"
brew "rust"
brew "go"
brew "composer"
brew "luajit-openresty"
brew "luarocks"
brew "openjdk"
brew "kotlin"

# package managers
brew "pnpm"
brew "poetry"
brew "gradle"

# casks
cask "kitty"
cask "wezterm"
cask "brave-browser"
cask "firefox-developer-edition"
cask "stats"
cask "monitorcontrol"
cask "visual-studio-code"

# fonts
cask "font-cascadia-code-pl"
cask "font-caskaydia-cove-nerd-font"
cask "font-inter"
cask "font-ibm-plex"
cask "font-fira-code"
cask "font-iosevka-aile"
cask "font-iosevka-etoile"
cask "font-source-code-pro"
cask "font-sauce-code-pro-nerd-font"
