tap "homebrew/bundle"
tap "homebrew/services"
tap "oven-sh/bun"


# shell
brew "bat"
brew "fd"
brew "jq"
brew "ripgrep"
brew "gh"
brew "git"
brew "git-delta"
brew "lazygit"
brew "gnupg"
brew "podman"
brew "tmux"
brew "starship"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# languages and runtimes
brew "oven-sh/bun/bun"
brew "node"
brew "deno"
brew "rust"
brew "go"
brew "composer"
brew "luajit-openresty"
brew "luarocks"
brew "openjdk"
brew "kotlin"

# package managers
brew "pnpm"
brew "poetry"
brew "gradle"

# macOS applications
cask "kitty"
cask "wezterm@nightly"
cask "brave-browser"
cask "firefox@developer-edition"
cask "stats"
cask "monitorcontrol"
cask "visual-studio-code"

# fonts
cask "font-inter"
cask "font-shantell-sans"
cask "font-recursive"
cask "font-ia-writer-mono"
cask "font-ia-writer-duo"
cask "font-ia-writer-quattro"
cask "font-ibm-plex-sans"
cask "font-ibm-plex-serif"
cask "font-ibm-plex-sans-condensed"

# programming fonts
cask "font-monaspace"
cask "font-cascadia-code-nf"
cask "font-ibm-plex-mono"
cask "font-recursive-code"
