# neovim btw
brew "neovim"

# shell
brew "bat"
brew "fzf"
brew "fd"
brew "jq"
brew "yq"
brew "ripgrep"
brew "gh"
brew "git"
brew "git-delta"
brew "lazygit"
brew "starship"
brew "container"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# languages and runtimes
brew "oven-sh/bun/bun"
brew "node"
brew "deno"
brew "rust"
brew "go"
brew "luarocks"
# brew "composer"

# package managers
brew "pnpm"
brew "uv"

# terminal emulators
cask "kitty"
cask "ghostty"
cask "wezterm@nightly"

# editors
cask "zed"
cask "visual-studio-code"

# browsers
cask "brave-browser"
cask "firefox@developer-edition"

# applications
cask "steam"
cask "discord"
cask "slack"
cask "zoom"
cask "sony-ps-remote-play"

# macOS utilities
cask "stats"
cask "gpg-suite-no-mail"
cask "monitorcontrol"

# fonts
cask "font-shantell-sans"
cask "font-recursive"
cask "font-ia-writer-mono"
cask "font-ia-writer-duo"
cask "font-ia-writer-quattro"
cask "font-ibm-plex-sans"
cask "font-ibm-plex-serif"
cask "font-ibm-plex-sans-condensed"

# programming fonts
cask "font-monaspace-nf"
cask "font-cascadia-code-nf"
cask "font-ibm-plex-mono"
cask "font-recursive-code"
